In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("pandas_5.csv")

In [3]:
df

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576
5   Thomas   24433

In [5]:
df["bonus"] = df["salary"] * 2

In [6]:
df

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866